
## Plan Result (tiny_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 18 to add, 0 to change, 18 to destroy.</code></pre>

* Create
  * proxmox_virtual_environment_download_file.tiny_images[&#34;hela-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;loki-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;thor-jammy-server-cloudimg-amd64.img&#34;]
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_virtual_machines[&#34;test0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;test0&#34;].proxmox_virtual_environment_vm.vm
* Delete
  * proxmox_virtual_environment_download_file.hela_images[&#34;jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.loki_images[&#34;jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.thor_images[&#34;jammy-server-cloudimg-amd64.img&#34;]
  * module.hela_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.hela_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_vm.vm
  * module.hela_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.hela_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_vm.vm
  * module.hela_virtual_machines[&#34;test0&#34;].proxmox_virtual_environment_file.cloud_config
  * module.hela_virtual_machines[&#34;test0&#34;].proxmox_virtual_environment_vm.vm
  * module.loki_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.loki_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_vm.vm
  * module.loki_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_file.cloud_config
  * module.loki_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_vm.vm
  * module.thor_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_file.cloud_config
  * module.thor_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_vm.vm
  * module.thor_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_file.cloud_config
  * module.thor_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_vm.vm
* Replace
  * terraform_data.k8s_ansible[&#34;tiny&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.hela_images["jammy-server-cloudimg-amd64.img"] will be destroyed
  # (because proxmox_virtual_environment_download_file.hela_images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "hela_images" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "jammy-server-cloudimg-amd64.img" -> null
      - id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> null
      - node_name           = "hela" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 652279808 -> null
      - upload_timeout      = 2400 -> null
      - url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img" -> null
      - verify              = true -> null
    }

  # proxmox_virtual_environment_download_file.loki_images["jammy-server-cloudimg-amd64.img"] will be destroyed
  # (because proxmox_virtual_environment_download_file.loki_images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "loki_images" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "jammy-server-cloudimg-amd64.img" -> null
      - id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> null
      - node_name           = "loki" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 652279808 -> null
      - upload_timeout      = 2400 -> null
      - url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img" -> null
      - verify              = true -> null
    }

  # proxmox_virtual_environment_download_file.thor_images["jammy-server-cloudimg-amd64.img"] will be destroyed
  # (because proxmox_virtual_environment_download_file.thor_images is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "thor_images" {
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "jammy-server-cloudimg-amd64.img" -> null
      - id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> null
      - node_name           = "thor" -> null
      - overwrite           = true -> null
      - overwrite_unmanaged = false -> null
      - size                = 652279808 -> null
      - upload_timeout      = 2400 -> null
      - url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img" -> null
      - verify              = true -> null
    }

  # proxmox_virtual_environment_download_file.tiny_images["hela-jammy-server-cloudimg-amd64.img"] will be created
  + resource "proxmox_virtual_environment_download_file" "tiny_images" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "hela-jammy-server-cloudimg-amd64.img"
      + id                  = (known after apply)
      + node_name           = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 2400
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.tiny_images["loki-jammy-server-cloudimg-amd64.img"] will be created
  + resource "proxmox_virtual_environment_download_file" "tiny_images" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "loki-jammy-server-cloudimg-amd64.img"
      + id                  = (known after apply)
      + node_name           = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 2400
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.tiny_images["thor-jammy-server-cloudimg-amd64.img"] will be created
  + resource "proxmox_virtual_environment_download_file" "tiny_images" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "thor-jammy-server-cloudimg-amd64.img"
      + id                  = (known after apply)
      + node_name           = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 2400
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # terraform_data.k8s_ansible["tiny"] must be replaced
-/+ resource "terraform_data" "k8s_ansible" {
      ~ id               = "9956b4ac-55d2-ed91-02b2-de237e7a201d" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            {},
          ~ {
              ~ hela-tiny-master0 = {
                  ~ primary_mac_address = "BC:24:11:22:1C:50" -> (known after apply)
                }
              ~ hela-tiny-node0   = {
                  ~ primary_mac_address = "BC:24:11:91:B7:DC" -> (known after apply)
                }
              + loki-tiny-master1 = {
                  + primary_mac_address = (known after apply)
                }
              + loki-tiny-node1   = {
                  + primary_mac_address = (known after apply)
                }
              + thor-tiny-master2 = {
                  + primary_mac_address = (known after apply)
                }
              + thor-tiny-node2   = {
                  + primary_mac_address = (known after apply)
                }
            },
          - {
              - thor-tiny-master2 = {
                  - primary_mac_address = "BC:24:11:8D:F5:D1"
                }
              - thor-tiny-node2   = {
                  - primary_mac_address = "BC:24:11:90:65:2A"
                }
            },
          - {
              - loki-tiny-master1 = {
                  - primary_mac_address = "BC:24:11:22:E4:A3"
                }
              - loki-tiny-node1   = {
                  - primary_mac_address = "BC:24:11:DE:E9:1B"
                }
            },
        ]
    }

  # module.hela_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_file.cloud_config will be destroyed
  # (because proxmox_virtual_environment_file.cloud_config is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "local" -> null
      - file_name      = "tiny-master0-cloud-config.yaml" -> null
      - id             = "local:snippets/tiny-master0-cloud-config.yaml" -> null
      - node_name      = "hela" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "tiny-master0-cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # module.hela_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_vm.vm will be destroyed
  # (because proxmox_virtual_environment_vm.vm is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "k8s control plane" -> null
      - id                      = "200" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.151.16.8",
            ],
          - [],
          - [],
          - [],
          - [
              - "10.42.201.64",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::be24:11ff:fe22:1c50",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::6414:a9ff:fe1d:220e",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:22:1C:50",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:14:A9:1D:22:0E",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiny-master0" -> null
      - network_interface_names = [
          - "lo",
          - "eth0",
          - "cali9739711c6f2",
          - "cali6e8b0f0e96e",
          - "calic8c09912c17",
          - "vxlan.calico",
          - "cali45ce1abeeb1",
          - "calif305217b481",
          - "cali91cf69cd3a6",
          - "califd0b124a471",
          - "cali5903883d67f",
          - "cali012cfc79d1d",
          - "calicb8b4fee4d1",
          - "calib141f15f7b2",
          - "cali0ff3a8c3c81",
          - "calibe0ec79d136",
          - "cali807de406453",
          - "cali17fdcd25208",
          - "califd53fe54ddb",
          - "cali72359d4e846",
          - "cali80b4e8061ff",
          - "calia618350b060",
          - "cali62771048369",
        ] -> null
      - node_name               = "hela" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "k8s",
          - "k8s-control-plane",
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 200 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 4 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "qemu64" -> null
          - units        = 1024 -> null
            # (1 unchanged attribute hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "on" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/jammy-server-cloudimg-amd64.img" -> null
          - interface         = "virtio0" -> null
          - iothread          = true -> null
          - path_in_datastore = "vm-200-disk-0" -> null
          - replicate         = true -> null
          - size              = 100 -> null
          - ssd               = false -> null
            # (1 unchanged attribute hidden)
        }

      - initialization {
          - datastore_id         = "local-lvm" -> null
          - interface            = "ide2" -> null
          - upgrade              = false -> null
          - user_data_file_id    = "local:snippets/tiny-master0-cloud-config.yaml" -> null
            # (4 unchanged attributes hidden)

          - ip_config {
              - ipv4 {
                  - address = "10.151.16.8/24" -> null
                  - gateway = "10.151.16.1" -> null
                }
            }
        }

      - memory {
          - dedicated      = 8192 -> null
          - floating       = 0 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr1" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = false -> null
          - mac_address  = "BC:24:11:22:1C:50" -> null
          - model        = "virtio" -> null
          - mtu          = 0 -> null
          - queues       = 0 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 16 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }

      - startup {
          - down_delay = -1 -> null
          - order      = 10 -> null
          - up_delay   = 0 -> null
        }
    }

  # module.hela_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_file.cloud_config will be destroyed
  # (because proxmox_virtual_environment_file.cloud_config is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "local" -> null
      - file_name      = "tiny-node0-cloud-config.yaml" -> null
      - id             = "local:snippets/tiny-node0-cloud-config.yaml" -> null
      - node_name      = "hela" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "tiny-node0-cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # module.hela_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm will be destroyed
  # (because proxmox_virtual_environment_vm.vm is not in configuration)
  - resource "proxmox_virtual_environment_vm" "vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "k8s worker node" -> null
      - id                      = "220" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.151.16.16",
            ],
          - [],
          - [],
          - [],
          - [
              - "10.42.166.192",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::be24:11ff:fe91:b7dc",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::64b6:dff:fe3c:31a8",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
          - [
              - "fe80::ecee:eeff:feee:eeee",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:91:B7:DC",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:B6:0D:3C:31:A8",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ] -> null
      - migrate                 = false -> null
      - name                    = "tiny-node0" -> null
      - network_interface_names = [
          - "lo",
          - "eth0",
          - "cali4844ad6cc14",
          - "cali1c1d35d1f7f",
          - "calibc058e910cb",
          - "vxlan.calico",
          - "cali1671e0a444f",
          - "cali128d54ac605",
          - "cali0ff08785cee",
          - "calib9fc427d6e5",
          - "calid5b8f7eb899",
          - "calic8514716e71",
          - "calic2261d6c30a",
        ] -> null
      - node_name               = "hela" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "k8s",
          - "k8s-worker",
          - "terraform",
     

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 = [
          + "terraform",
          + "k8s",
          + "k8s-control-plane",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 201

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.9/24"
                  + gateway = "10.151.16.1"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 10
          + up_delay   = 0
        }
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "loki"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "tiny-node1-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiny-node1"
      + network_interface_names = (known after apply)
      + node_name               = "loki"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 221

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.17/24"
                  + gateway = "10.151.16.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "thor"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "tiny-master2-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s control plane"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiny-master2"
      + network_interface_names = (known after apply)
      + node_name               = "thor"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-control-plane",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 202

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.10/24"
                  + gateway = "10.151.16.1"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 10
          + up_delay   = 0
        }
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "thor"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "tiny-node2-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "tiny-node2"
      + network_interface_names = (known after apply)
      + node_name               = "thor"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 222

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.18/24"
                  + gateway = "10.151.16.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }
    }

  # module.tiny_virtual_machines["test0"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "hela"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "test0-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_virtual_machines["test0"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Test VM."
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "test0"
      + network_interface_names = (known after apply)
      + node_name               = "hela"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 120

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.100/24"
                  + gateway = "10.151.16.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 5
          + up_delay   = 0
        }
    }

Plan: 18 to add, 0 to change, 18 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":245,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->